{
  "title": "PI - MORA",
  "description": "Raspberry JAM's are independently organised community events for people to come together to learn about digital making with Raspberry Pi. ENTC will undertake 3 Raspberry JAMs (Pi-MORA's) every academic year. Undertaking to teach Pi enthusiasts about the capabilities of the Raspberry Pi platform.",
  "tabs": [
    {
      "name": "2022/2023",
      "details": [
        {
          "name": "Pi Mora 2.1 - Ethical Hacking Workshop",
          "description": "PiMora 2.1, organized by the Electronic Club and powered by Spark@UoM, took place on September 24-25, 2022. The event featured a two-day session led by Mr. Yasiru Senarath, an undergraduate from the Department of Electronics and Telecommunication Engineering at the University of Moratuwa. It focused on ethical hacking, offering both theoretical and practical insights. Day 1 covered an introduction to ethical hacking, basic terminal commands, and cybersecurity fundamentals. Day 2 included a hands-on workshop on hardware overviews, Raspberry Pi setup, working with GPIOs, and defending against ARP attacks, with a demonstration of attack and defense techniques. Missed PiMora 2.1? Full sessions are now available on YouTube: Day 1 - https://bit.ly/3rJTDo1, Day 2 - https://bit.ly/3SzRSWb.",
          "images": [
            "/images/maintainedData/piMora/PiMORA1_img1.jpeg",
            "/images/maintainedData/piMora/PiMORA1_img2.jpeg"
          ],
          "members": ["Mr. Yasiru Senarath"]
        },
        {
          "name": "Pi Mora 2.2 - Computer Vision with Raspberry Pi",
          "description": "PiMora 2.2, organized by the Electronic Club of the University of Moratuwa and powered by Spark@UoM, was held on the 13th of December 2022. The session was led by Mr. Bimalka Piyaruwan, an undergraduate at the Department of Electronics and Telecommunication Engineering, University of Moratuwa, who guided participants through the fascinating world of computer vision. During this session, participants learned about computer vision and how it works using Raspberry Pi. The workshop offered a unique opportunity to gain hands-on experience and insights into this exciting field.",
          "images": ["/images/maintainedData/piMora/PiMORA2_img1.jpeg"],
          "members": ["Mr. Bimalka Piyaruwan"]
        }
      ]
    }
  ]
}
